# Библиотека Pandas

Эмели Драль, mailto: emeli.dral@gmail.com

## Data Frame

In [1]:
import pandas as pd

In [9]:
#создание DataFrame по столбцам с помощью словарей
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [10]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [11]:
frame.chars

0    a
1    a
2    a
3    a
4    a
5    a
6    a
7    a
8    a
9    a
Name: chars, dtype: object

In [12]:
frame['chars']

0    a
1    a
2    a
3    a
4    a
5    a
6    a
7    a
8    a
9    a
Name: chars, dtype: object

In [25]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [27]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [28]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [29]:
frame.shape

(6, 4)

In [30]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [34]:
frame.index

RangeIndex(start=0, stop=6, step=1)

In [35]:
#добавление строки в DataFrame
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [36]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [37]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [38]:
#добавление столбца в DataFrame
frame['IsStudent'] = [False]*5 + [True]*2

In [58]:
[False]*5 + [True]*2

[False, False, False, False, False, True, True]

In [39]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6            Perov  22.03.1990      Penza       NaN      True

In [46]:
#удаление строк DataFrame
frame.drop([4, 6], axis=0)

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
5     Костров С.О.  31.05.1985     Москва    стажер      True

In [41]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6            Perov  22.03.1990      Penza       NaN      True

In [16]:
?frame.drop

In [47]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

In [50]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False

In [51]:
frame['Position'] == 'инженер'

0    False
1     True
2    False
3    False
4     True
Name: Position, dtype: bool

In [56]:
frame.drop?

In [53]:
frame.index[frame['Position'] == 'инженер']

Int64Index([1, 4], dtype='int64')

In [55]:
labels = frame.index[frame['Position'] == 'инженер']
frame.drop(labels, axis=0)

              Name       Birth    City  Position IsStudent
0      Иванов А.А.  22.03.1980  Москва       NaN     False
2       Белов М.М.  13.02.1980  Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985  Ростов       NaN     False

In [57]:
frame[frame['Position'] != "инженер"]

              Name       Birth    City  Position IsStudent
0      Иванов А.А.  22.03.1980  Москва       NaN     False
2       Белов М.М.  13.02.1980  Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985  Ростов       NaN     False

In [19]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [20]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [21]:
#запись DataFrame в файл
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=False, encoding='utf-8')